# IsDefault Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Railing..::..IsDefault Property
Railing Class See Also
---
Indicates if the railing is the default one that system generates.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsDefault { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsDefault As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsDefault {
	bool get ();
}
```

# See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace